Repository: miurahr/translate-django-ja
Catalog: tm/django.tmx
Source language: en_us
Languages: ja

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
ja: 例えば、ユーザが "/articles/2005/05/39323/" という URL をリクエストすると、 Django は ``news.views.article_detail(request, '2005', '05', '39323')`` のような関数呼び出しを行います。

source: Write your views
ja: ビューの自作

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
ja: 各ビュー (view) には二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :class:`~django.http.Http404` のような例外の送出です。それ以外の処理はユーザ次第です。

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
ja: この例では Django の :doc:`テンプレートシステム </topics/templates>` を使っ ています。テンプレートシステムは、強力な機能をいくつも備えながらも、非プロ グラマが使いこなせる程度に簡単な仕組みです。

source: Design your templates
ja: テンプレートを設計する

source: The code above loads the ``news/year_archive.html`` template.
ja: 上のコードでは ``news/article_detail.html`` という名前のテンプレートをロー ドしています。

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
ja: さて、 ``news/year_archive.html`` が見つかったとしましょう。テンプレートは以下のように書かれています:

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
ja: ``{{ article.pub_date|date:"F j, Y" }}`` で、 Unix スタイルの「パイプ」 (文字 “|”) を使っていることに注意して下さい。これはテンプレートフィルターと呼ばれ、変数の値にフィルターをかけるためのものです。この例では、フィルタによって Python の datetime オブジェクトを指定の形式にフォーマットしています (PHP の date 関数に似ていますね) 。

source: You can chain together as many filters as you'd like. You can write :ref:`custom template filters <howto-writing-custom-template-filters>`. You can write :doc:`custom template tags </howto/custom-template-tags>`, which run custom Python code behind the scenes.
ja: フィルターはいくつでも好きなだけ繋げることが出来ます。また、独自の Python コードを実行する :ref:`カスタムテンプレートフィルタ <howto-writing-custom-template-filters>` や :doc:`カスタムテンプレートタグ</howto/custom-template-tags>` を書くことも出来ます。

source: Here's what the "base.html" template, including the use of :doc:`static files </howto/static-files/index>`, might look like:
ja: ここでよくある“base.html” テンプレートで、 :doc:`静的ファイルの配信 </howto/static-files/index>` を含む例をあげます:

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
ja: このテンプレートはサイトのルック & フィール (とサイトのロゴ) を定義するだけ にまで、極度に単純化されています。また、子テンプレートで埋めるための「穴」 を提供しています。これによって、ベーステンプレート一つを変更するだけでサイ ト全体のデザインを簡単に変更できます。

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
ja: 他のシステムを使いたければ、必ずしも Django のテンプレートシステムを使う必 要はないということに注意してください。 Django のテンプレートシステムは Django のモデルレイヤと部分的にしっかり組み合わさっていますが、絶対に使わねばならないということではありません。さらに言えば、 Django のデータベース API を使う必然性もありません。別のデータベース抽象化レイヤを使っても構いま せんし、 XML ファイルやディスク上のファイルを読み込んでも構いません。何でもやりたいことをできるのです。Django の構成要素 – モデル、ビュー、テンプレー ト – は、互いに切り離して利用できるのです。

source: This is just the surface
ja: これらはほんの一部にすぎません

source: This has been only a quick overview of Django's functionality.
ja: 以上、 Django の機能についてざっと紹介してきました。

source: Some more useful features:
ja: Django は他にもまだま だ便利な機能を備えています:

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
ja: memcached などのバックエンドを組み込んだ :doc:`キャッシュフレームワーク </topics/cache>` 。

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
ja: 小さな Python クラスを書くだけで簡単に RSS や Atom フィードを生成できる :doc:`配信フィードフレームワーク </ref/contrib/syndication>` 。

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
ja: 自動生成される admin のセクシーな機能の数々。ここで紹介したのはほんの表層の一部でしかありません。

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
ja: 次は、あなたが `Django をダウンロード`_ して、 :doc:`チュートリアル </intro/tutorial01>` を読み、 `コミュニティ`_ に参加する番です。ご精読ありがとうございました!

source: Advanced tutorial: How to write reusable apps
ja: 高度なチュートリアル: 再利用可能アプリの書き方

source: This advanced tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off.
ja: このチュートリアルは :doc:`チュートリアル 6 </intro/tutorial06>`のあとに続いています。

source: We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
ja: Web 投票アプリケーションを独立した Python パッケージにすることで、新規のプロジェクトで再利用したり、他の人に共有したりできます。

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
ja: 直近のチュートリアル 1 - 6 が終わっていないなら、一目通すことをおすすめします。例で作ったプロジェクトが以下の説明でも使われるからです。

source: Reusability matters
ja: 再利用性の問題

source: It's a lot of work to design, build, test and maintain a web application. Many Python and Django projects share common problems. Wouldn't it be great if we could save some of this repeated work?
ja: Web アプリケーションの設計、開発、テスト、そしてメンテナンスには多大な労力が必要です。そして多くの Python 、 Django プロジェクト は共通の問題を抱えています。この繰り返し作業を一部保存して保存しておければ良いと思いませんか？

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 3 </intro/tutorial03>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
ja: 投票アプリケーションが必要なプロジェクトを開始したとしましょう。ちょうど今まで作ってきたものと似たようなものです。どうやってその アプリケーションを再利用可能にしますか？運のいいことに、その方法はすでに会得済みです。 :doc:`チュートリアル3 </intro/tutorial03>` では、プロジェクトレベルの URLconf から ``include`` を使って、投票アプリを分離する方法をみました。このチュートリアルではアプリケーションを新規のプロジェクトで使いやすいようにし、いつでも別の場所でインストール/利用できるようにしました。

source: A package can be imported with ``import foo.bar`` or ``from foo import bar``. For a directory (like ``polls``) to form a package, it must contain a special file ``__init__.py``, even if this file is empty.
ja: パッケージは ``import foo.bar`` または ``from foo import bar`` でインポートできます。パッケージ内のディレクトリ (例えば ``polls``) は ``__init__.py`` という特殊なファイルを、空のファイルでもいいので含む必要があります。

source: Later on we use the term *packaging* to describe the process of making a Python package easy for others to install. It can be a little confusing, we know.
ja: 以降 *パッケージング* という言葉を、別の場所でインストールしやすいように Python パッケージを作るプロセスを表すのに用います。少し混乱するかもしれませんね。

source: Your project and your reusable app
ja: プロジェクトと再利用可能アプリ

source: After the previous tutorials, our project should look like this::
ja: 前のチュートリアルを終えると、プロジェクトはこのようになっていたはずです::

source: You created ``mysite/templates`` in :doc:`Tutorial 2 </intro/tutorial02>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
ja: すでに ``mysite/templates`` を :doc:`チュートリアル 2 </intro/tutorial02>` で、 ``polls/templates`` を :doc:`チュートリアル 3 </intro/tutorial03>` で作成しました。今になるとなぜテンプレートディレクトリをプロジェクトとアプリケーションに分けたかが明確にわかりますね。投票アプリケーションに関する全ては ``polls`` にあります。アプリケーションが自己完結していて、新規のプロジェクトにも導入しやすくなっています。

source: The ``polls`` directory could now be copied into a new Django project and immediately reused. It's not quite ready to be published though. For that, we need to package the app to make it easy for others to install.
ja: 今、 ``polls`` ディレクトリは新規の Django プロジェクトにコピーでき、すぐに再利用できる状態です。しかし公開するための準備が完璧というわけではありません。そのために、アプリをパッケージにして別の場所でインストールしやすいようにする必要があります。

source: Installing some prerequisites
ja: 事前に必要な物をインストールする

source: Packaging your app
ja: アプリケーションをパッケージングする

source: Python *packaging* refers to preparing your app in a specific format that can be easily installed and used. Django itself is packaged very much like this. For a small app like polls, this process isn't too difficult.
ja: Python の *パッケージング* は特定のフォーマットでアプリを作っておくことを指します。このフォーマットは簡単にインストールして使えます。 Django 自体もこのようにパッケージ化されています。投票アプリのような小さなものでは、このプロセスはそれほど難しいものではありません。

source: First, create a parent directory for ``polls``, outside of your Django project.
ja: はじめに、 ``polls`` の親ディレクトリを、 Django プロジェクトの外に作りましょう。

source: Call this directory ``django-polls``.
ja: ``django-polls`` というディレクトリにします。

source: When choosing a name for your package, check resources like PyPI to avoid naming conflicts with existing packages. It's often useful to prepend ``django-`` to your module name when creating a package to distribute. This helps others looking for Django apps identify your app as Django specific.
ja: パッケージの名前を決めるときま、 PyPI のようなリソースをチェックして、すでにあるパッケージとの名前の衝突を避ける必要があります。 Django アプリケーションのパッケージを作って配布する際には、モジュール名の先頭に ``django-`` を付けるのがよいでしょう。これによって Django アプリを探してる人が、作ったアプリが Django 特化のものであると分かりやすいからです。

source: Move the ``polls`` directory into the ``django-polls`` directory.
ja: ``polls`` ディレクトリを ``django-polls`` ディレクトリに移動する

source: It's optional, but recommended, to include detailed documentation with your app. Create an empty directory ``django-polls/docs`` for future documentation. Add an additional line to ``django-polls/MANIFEST.in``::
ja: アプリケーションの詳細なドキュメントを含めるのは、任意ですが推奨されます。空のディレクトリ ``django-polls/docs`` を将来のドキュメンテーションのために作っておきましょう。 ``django-polls/MANAFEST.in`` に行を追加しておいてください::

source: Try building your package with ``python setup.py sdist`` (run from inside ``django-polls``). This creates a directory called ``dist`` and builds your new package, ``django-polls-0.1.tar.gz``.
ja: ``python setup.py sdist`` でパッケージをビルドしてみましょう (``django-polls`` 内で実行してください) 。これによって ``dist`` というディレクトリと、新しいパッケージである ``django-polls-0.1.tar.gz`` が作られます。

source: Using your own package
ja: 自分のパッケージを使ってみる

source: Since we moved the ``polls`` directory out of the project, it's no longer working. We'll now fix this by installing our new ``django-polls`` package.
ja: ``polls`` ディレクトリはプロジェクト外に移動したので、これはもう必要ありません。代わりにできたての ``django-polls`` パッケージを使ってみましょう。

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
ja: ユーザー単位でのインストールは依然、そのユーザーのシステムツールの振る舞いに影響をあたえます。なので ``virtualenv`` はより確実な解決になります (下記を参照してください) 。

source: With luck, your Django project should now work correctly again. Run the server again to confirm this.
ja: 運が良ければ Django プロジェクトは再度、正常に動作します。確認するために再びサーバーを起動します。

source: Publishing your app
ja: アプリを公開する

source: Now that we've packaged and tested ``django-polls``, it's ready to share with the world! If this wasn't just an example, you could now:
ja: ``django-polls`` のパッケージを作り、テストしました。世界に共有するときです！これが単なる例でなければこうします::

source: Email the package to a friend.
ja: パッケージを友人にメールで送る

source: Upload the package on your Web site.
ja: 自身の Web サイトにアップロードする

source: Installing Python packages with virtualenv
ja: virtualenv に Python パッケージをインストールする

source: Earlier, we installed the polls app as a user library. This has some disadvantages:
ja: これまでは投票アプリをユーザーライブラリにインストールしてきました。これにはいくつか欠点があります:

source: Modifying the user libraries can affect other Python software on your system.
ja: ユーザーライブラリの変更はシステム上の他の Python ソフトウェアに影響を与えるおそれがあります

source: You won't be able to run multiple versions of this package (or others with the same name).
ja: このパッケージの複数バージョン (もしくは同じ名前の別のもの) を実行できません

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <http://www.virtualenv.org/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
ja: 一般的に、複数の Django プロジェクトをメンテナンスしてる場合に生じる問題です。そうであるなら、一番良い解決策は `virtualenv <http://www.virtualenv.org/>`_ を使用することです。このツールを使えば複数の独立した Python 環境をメンテナンスできます。それぞれでライブラリのコピーと、パッケージの名前空間を独自に管理出来ます。

source: Writing your first Django app, part 1
ja: はじめての Django アプリ作成、その 1

source: Let's learn by example.
ja: さあ、例を交えながら学んでゆきましょう。

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
ja: このチュートリアルでは、簡単な投票 (poll) アプリケーションの作成に取り組ん でもらいます。

source: It'll consist of two parts:
ja: Poll アプリケーションは 2 つの部分からなります:

source: A public site that lets people view polls and vote in them.
ja: ユーザが投票したり結果を表示したりできる公開用サイト

source: An admin site that lets you add, change and delete polls.
ja: 投票項目の追加、変更、削除を行うための管理 (admin) サイト

source: We'll assume you have :doc:`Django installed </intro/install>` already.
ja: :doc:`Django は既にインストール済み </intro/install>` として、説明を進めます。

source: You can tell Django is installed and which version by running the following command:
ja: Django がインストールされている、どのバージョンか調べるには、以下のコマンドを実行します:

source: If Django is installed, you should see the version of your installation. If it isn't, you'll get an error telling "No module named django".
ja: Django がインストールされていれば、インストールされている Django のバージョンがわかります。もしなければ "No module named django" とエラーが表示されます。

source: See :doc:`How to install Django </topics/install>` for advice on how to remove older versions of Django and install a newer one.
ja: :doc:`Django のインストール方法 </topics/install>` を見て、 Django の旧バージョンを削除してより新しいものをインストールしてください。

source: Creating a project
ja: プロジェクトを作成する

source: If this is your first time using Django, you'll have to take care of some initial setup. Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
ja: 初めて Django を使うのなら、最初のセットアップを行う必要があります。通常は、 Django の :term:`プロジェクト` (:term:`project`) を構成するコードを自動生成します。プロジェクトとは、データベースの設定や Django 固有のオプション、アプリケーション固有の設定などといった、個々の Django インスタンスの設定を集めたものです。

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
ja: コマンドラインから、コードを置きたい場所に ``cd`` して、以下のコマンドを 実行してください。

source: You'll need to avoid naming projects after built-in Python or Django components. In particular, this means you should avoid using names like ``django`` (which will conflict with Django itself) or ``test`` (which conflicts with a built-in Python package).
ja: プロジェクトの名前を付けるとき、組み込みの Python モジュールや Django のコンポーネントの名前を使わないようにしてください。とりわけ、 ``django`` (Django 自体と名前が衝突します) や ``test`` (組み込みの Python パッケージ名と名前が衝突します) を使わないようにしましょう。

source: Where should this code live?
ja: コードはどこに置くの？

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``). With Django, you don't do that. It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web. That's not good for security.
ja: (モダンなフレームワークを使わない) 古いプレーンな PHP の経験があるなら、これまでは Web サーバのドキュメントルート下 (``/var/www`` といった場所) にコードを配置してきたことでしょう。 Django ではそうしないでください｡ Python コードを Web サーバーのドキュメントルート下に置かないでください｡コードをドキュメントルート下に置くと、 誰かがコードを Web を介して読めるようになってしまうからです。これは安全上良くありません。

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
ja: コードはドキュメントルートの外､例えば ``/home/mycode`` の ような場所に置きましょう。

source: Let's look at what :djadmin:`startproject` created::
ja: :djadmin:`startproject` が何を作成したかをみてみましょう::

source: These files are:
ja: ファイルはそれぞれ以下のような役割を持っています::

source: The outer :file:`mysite/` root directory is just a container for your project.
ja: 外側の :file:`mysite/` ルートディレクトリは、このプロジェクトのただの入れ物です。

source: Its name doesn't matter to Django; you can rename it to anything you like.
ja: この名前は Django に関係しませんので、好きな名前に変更できます。

source: :file:`manage.py`: A command-line utility that lets you interact with this Django project in various ways. You can read all the details about :file:`manage.py` in :doc:`/ref/django-admin`.
ja: :file:`manage.py`: Django プロジェクトに対する様々な操作を行うためのコマンドラインユーティリティです｡詳しくは :doc:`/ref/django-admin` 内の :file:`manage.py` を参照してください｡

source: The inner :file:`mysite/` directory is the actual Python package for your project. Its name is the Python package name you'll need to use to import anything inside it (e.g. ``mysite.urls``).
ja: 内側の :file:`mysite/` ディレクトリは、このプロジェクトの本当の Python パッケージです。この名前が Python パッケージの名前であり、 import の際に 使用する名前です (例えば import ``mysite.urls``) 。

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. (Read `more about packages`_ in the official Python docs if you're a Python beginner.)
ja: :file:`mysite/__init__.py`: このディレクトリが Python パッケージであることを Python に知らせるための空のファイルです。(Python の初心者は、 Python の公式 ドキュメントの `パッケージの詳しい説明`_ を読んで下さい。)

source: :file:`mysite/settings.py`: Settings/configuration for this Django project.
ja: :file:`mysite/settings.py`: Django プロジェクトの設定ファイルです。

source: :doc:`/topics/settings` will tell you all about how settings work.
ja: 設定の仕組みは :doc:`/topics/settings` を参照してください。

source: :file:`mysite/urls.py`: The URL declarations for this Django project; a "table of contents" of your Django-powered site. You can read more about URLs in :doc:`/topics/http/urls`.
ja: :file:`mysite/urls.py`: Django プロジェクトの URL 宣言、いうなれば Django サイトにおける「目次」に相当します。詳しくは :doc:`/topics/http/urls` を参照 してください。

source: :file:`mysite/wsgi.py`: An entry-point for WSGI-compatible web servers to serve your project. See :doc:`/howto/deployment/wsgi/index` for more details.
ja: :file:`mysite/wsgi.py`: プロジェクトをサーブするためのWSGI互換Webサーバーとのエントリーポイントです。詳細は :doc:`/howto/deployment/wsgi/index` を参照してください。

source: Database setup
ja: Database の設定

source: If you're using PostgreSQL or MySQL, make sure you've created a database by this point.
ja: もし PostgreSQL や MySQL を使っている場合、 database を今のうちに作っておいてください。

source: Do that with "``CREATE DATABASE database_name;``" within your database's interactive prompt.
ja: "``CREATE DATABASE database_name;``" とデータベースのインタラクティブプロンプトで実行してください。

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
ja: SQLite を使っている場合は、前もってすることはありません。必要であればデータベースファイルが自動で生成されます。

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
ja: デフォルトでは、 :settings:`INSTALLED_APPS` には以下のアプリケーションがはいっています。

source: :mod:`django.contrib.auth` -- An authentication system.
ja: :mod:`django.contrib.auth` - 認証システム

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
ja: :mod:`django.contrib.contenttypes` - コンテンツタイプフレームワーク

source: :mod:`django.contrib.sessions` -- A session framework.
ja: :mod:`django.contrib.sessions` - セッションフレームワーク

source: :mod:`django.contrib.messages` -- A messaging framework.
ja: :mod:`django.contrib.messages` - メッセージフレームワーク

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
ja: :mod:`django.contrib.staticfiles` - 静的ファイルの管理フレームワーク

source: These applications are included by default as a convenience for the common case.
ja: これらの機能はよく使われるのでデフォルトで付属しています。

source: For the minimalists
ja: ミニマリストのために

source: The development server
ja: 開発用サーバー

source: You've started the Django development server, a lightweight Web server written purely in Python.
ja: これで、 Django 開発サーバを起動しました。

source: We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
ja: Django 開発サーバは Python だけで書かれた軽量な Web サーバです。このサーバは、開発を迅速に行い、運用に適した状態になるまで Apache のような運用サーバの設定をいじらなくても良いようにするためのものです。

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Welcome to Django" page, in pleasant, light-blue pastel. It worked!
ja: さあ、これでサーバが起動したので、ブラウザで http://127.0.0.1:8000/ にアクセスしてみてください。 “Welcome to Django” と表示された、明るいパステル調のライトブルーのページが出るはずです。やりましたね！

source: Changing the port
ja: ポート番号の変更

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
ja: デフォルトでは :djadmin:`runserver` コマンドは内部 IP のポート 8000 で起動します。

source: If you want to change the server's port, pass it as a command-line argument. For instance, this command starts the server on port 8080:
ja: サーバーのポートを変えたい場合は、以下のようにコマンドライン引数を渡してください。このコマンドによってポート 8080 で起動させれます:

source: Full docs for the development server can be found in the :djadmin:`runserver` reference.
ja: 開発サーバーの詳細な説明は :djadmin:`runserver` のリファレンスを参照して下さい。

source: Creating models
ja: モデルの作成

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
ja: さあ、これで自分用の環境、すなわちプロジェクトが立ち上がり、作業にとりかかる準備ができました。

source: Each application you write in Django consists of a Python package that follows a certain convention.
ja: Django 内に追加する各アプリケーションは以下の規則に従った Python パッケージで構成されます。

source: Django comes with a utility that automatically generates the basic directory structure of an app, so you can focus on writing code rather than creating directories.
ja: Django には基本的なディレクトリ構造を自動生成するユーティリティが含まれているので、ディレクトリを作ることでなくコードを書くことに集中できます。

source: Projects vs. apps
ja: プロジェクトとアプリケーション

source: What's the difference between a project and an app? An app is a Web application that does something -- e.g., a Weblog system, a database of public records or a simple poll app. A project is a collection of configuration and apps for a particular Web site. A project can contain multiple apps. An app can be in multiple projects.
ja: プロジェクトとアプリケーションの違いとは何でしょうか？アプリケーションとは、実際に何らかの処理を行う Web アプリケーションを指します。例えばブログシステムや公開レコードのデータベース、単純な投票アプリといった具合です。プロジェクトとは、あるウェブサイト向けに設定とアプリケーションを集めたものです。一つのプロジェクトには複数のアプリケーションを入れられ ます。また、一つのアプリケーションは複数のプロジェクトで使えます。

source: Your apps can live anywhere on your `Python path`_. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
ja: アプリケーションは `Python パス`_ のどこにでも置けます。このチュートリアルでは投票アプリケーションを :file:`manage.py` のすぐ隣に作ります。なので、 ``mysite`` のサブモジュールとしてでなく、トップレベルのモジュールとしてインポートできます。

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
ja: アプリケーションを作るには、 :file:`manage.py` と同じディレクトリに入って、このコマンドを実行します:

source: That'll create a directory :file:`polls`, which is laid out like this::
ja: このコマンドは :file:`polls` というディレクトリを作成します。中身はこのようになっています::

source: This directory structure will house the poll application.
ja: このディレクトリ構造が、 poll アプリケーションの全体像です。

source: The first step in writing a database Web app in Django is to define your models -- essentially, your database layout, with additional metadata.
ja: Django でデータベース Web アプリケーションを書くための最初のステップは、モ デルの定義です。本質的にはデータベースのレイアウトと、追加のメタデータの定義です。

source: Philosophy
ja: 設計哲学
